app/controllers/profiles_controller.rb

SELECT "users".* FROM "users" WHERE "users"."profile_name" = 'chris' LIMIT 1
SELECT "statuses".* FROM "statuses" WHERE "statuses"."user_id" = 5
---
  def show
  	@user = User.find_by_profile_name(params[:id])
  	if @user
  		@statuses = @user.statuses.all