app/controllers/statuses_controller.rb

SELECT "statuses".* FROM "statuses"
---
  def index
    @statuses = Status.all

SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @status = Status.find(params[:id])

SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @status = Status.find(params[:id])

INSERT INTO "statuses" ("content", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["content", "This is content."], ["created_at", Mon, 03 Jun 2013 16:34:43 UTC +00:00], ["name", "Christopher"], ["updated_at", Mon, 03 Jun 2013 16:34:43 UTC +00:00]]
---
  def create
    @status = current_user.statuses.new(params[:status])
    respond_to do |format|
      if @status.save

SELECT "statuses".* FROM "statuses" WHERE "statuses"."user_id" = 2 AND "statuses"."id" = ? LIMIT 1  [["id", "10"]]
UPDATE "statuses" SET "content" = 'Editing my status!', "updated_at" = '2013-09-02 09:34:15.726609' WHERE "statuses"."id" = 5
---
  def update
    @status = current_user.statuses.find(params[:id])
    if params[:status] && params[:status].has_key?(:user_id)
      params[:status].delete(:user_id)
    end
    respond_to do |format|
      if @status.update_attributes(params[:status])

SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "statuses" WHERE "statuses"."id" = ?  [["id", 3]]
---
  def destroy
    @status = Status.find(params[:id])
    @status.destroy